Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
          </instance>
        </module>
        <module name="PIO" id="11004" version="H">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            
          <signals>
      <signal pad="PA0" function="default" group="P" index="0"/>
      <signal pad="PA1" function="default" group="P" index="1"/>
      <signal pad="PA2" function="default" group="P" index="2"/>
      <signal pad="PA3" function="default" group="P" index="3"/>
      <signal pad="PA4" function="default" group="P" index="4"/>
      <signal pad="PA5" function="default" group="P" index="5"/>
      <signal pad="PA6" function="default" group="P" index="6"/>
      <signal pad="PA7" function="default" group="P" index="7"/>
      <signal pad="PA8" function="default" group="P" index="8"/>
      <signal pad="PA9" function="default" group="P" index="9"/>
      <signal pad="PA10" function="default" group="P" index="10"/>
      <signal pad="PA11" function="default" group="P" index="11"/>
      <signal pad="PA12" function="default" group="P" index="12"/>
      <signal pad="PA13" function="default" group="P" index="13"/>
      <signal pad="PA14" function="default" group="P" index="14"/>
      <signal pad="PA15" function="default" group="P" index="15"/>
      <signal pad="PA16" function="default" group="P" index="16"/>
      <signal pad="PA17" function="default" group="P" index="17"/>
      <signal pad="PA18" function="default" group="P" index="18"/>
      <signal pad="PA19" function="default" group="P" index="19"/>
      <signal pad="PA20" function="default" group="P" index="20"/>
      <signal pad="PA21" function="default" group="P" index="21"/>
      <signal pad="PA22" function="default" group="P" index="22"/>
      <signal pad="PA23" function="default" group="P" index="23"/>
      <signal pad="PA24" function="default" group="P" index="24"/>
      <signal pad="PA25" function="default" group="P" index="25"/>
      <signal pad="PA26" function="default" group="P" index="26"/>
      <signal pad="PA27" function="default" group="P" index="27"/>
      <signal pad="PA28" function="default" group="P" index="28"/>
      <signal pad="PA29" function="default" group="P" index="29"/>
      <signal pad="PA30" function="default" group="P" index="30"/>
      <signal pad="PA31" function="default" group="P" index="31"/>
      <signal pad="PA23" function="X1" group="PIODCCLK"/>
      <signal pad="PA24" function="X1" group="PIODC" index="0"/>
      <signal pad="PA25" function="X1" group="PIODC" index="1"/>
      <signal pad="PA26" function="X1" group="PIODC" index="2"/>
      <signal pad="PA27" function="X1" group="PIODC" index="3"/>
      <signal pad="PA28" function="X1" group="PIODC" index="4"/>
      <signal pad="PA29" function="X1" group="PIODC" index="5"/>
      <signal pad="PA31" function="X1" group="PIODC" index="7"/>
      <signal pad="PA30" function="X1" group="WKUP" index="11"/>
      <signal pad="PA30" function="X1" group="PIODC" index="6"/>
      <signal pad="PA15" function="X1" group="WKUP" index="14"/>
      <signal pad="PA15" function="X1" group="PIODCEN" index="1"/>
      <signal pad="PA16" function="X1" group="WKUP" index="15"/>
      <signal pad="PA16" function="X1" group="PIODCEN" index="2"/>
    </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          <signals>
      <signal pad="PB0" function="default" group="P" index="32"/>
      <signal pad="PB1" function="default" group="P" index="33"/>
      <signal pad="PB2" function="default" group="P" index="34"/>
      <signal pad="PB3" function="default" group="P" index="35"/>
      <signal pad="PB4" function="default" group="P" index="36"/>
      <signal pad="PB5" function="default" group="P" index="37"/>
      <signal pad="PB6" function="default" group="P" index="38"/>
      <signal pad="PB7" function="default" group="P" index="39"/>
      <signal pad="PB8" function="default" group="P" index="40"/>
      <signal pad="PB9" function="default" group="P" index="41"/>
      <signal pad="PB10" function="default" group="P" index="42"/>
      <signal pad="PB11" function="default" group="P" index="43"/>
      <signal pad="PB12" function="default" group="P" index="44"/>
      <signal pad="PB13" function="default" group="P" index="45"/>
      <signal pad="PB14" function="default" group="P" index="46"/>
    </signals>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x400E1200"/>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0x400E1400"/>
          <signals>
      <signal pad="PD0" function="default" group="P" index="96"/>
      <signal pad="PD1" function="default" group="P" index="97"/>
      <signal pad="PD2" function="default" group="P" index="98"/>
      <signal pad="PD3" function="default" group="P" index="99"/>
      <signal pad="PD4" function="default" group="P" index="100"/>
      <signal pad="PD5" function="default" group="P" index="101"/>
      <signal pad="PD6" function="default" group="P" index="102"/>
      <signal pad="PD7" function="default" group="P" index="103"/>
      <signal pad="PD8" function="default" group="P" index="104"/>
      <signal pad="PD9" function="default" group="P" index="105"/>
      <signal pad="PD10" function="default" group="P" index="106"/>
      <signal pad="PD11" function="default" group="P" index="107"/>
      <signal pad="PD12" function="default" group="P" index="108"/>
      <signal pad="PD13" function="default" group="P" index="109"/>
      <signal pad="PD14" function="default" group="P" index="110"/>
      <signal pad="PD15" function="default" group="P" index="111"/>
      <signal pad="PD16" function="default" group="P" index="112"/>
      <signal pad="PD17" function="default" group="P" index="113"/>
      <signal pad="PD18" function="default" group="P" index="114"/>
      <signal pad="PD19" function="default" group="P" index="115"/>
      <signal pad="PD20" function="default" group="P" index="116"/>
      <signal pad="PD21" function="default" group="P" index="117"/>
      <signal pad="PD22" function="default" group="P" index="118"/>
      <signal pad="PD23" function="default" group="P" index="119"/>
      <signal pad="PD24" function="default" group="P" index="120"/>
      <signal pad="PD25" function="default" group="P" index="121"/>
      <signal pad="PD26" function="default" group="P" index="122"/>
      <signal pad="PD27" function="default" group="P" index="123"/>
      <signal pad="PD28" function="default" group="P" index="124"/>
      <signal pad="PD29" function="default" group="P" index="125"/>
      <signal pad="PD30" function="default" group="P" index="126"/>
      <signal pad="PD31" function="default" group="P" index="127"/>
    </signals>
          </instance>
          <instance name="PIOE">
            <register-group address-space="base" name="PIOE" name-in-module="PIO" offset="0x400E1600"/>
