Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
        <module name="SUPC" id="6452" version="P">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1810"/>
          </instance>
        </module>
        <module name="TC" id="6082" version="Q">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40090000"/>
            
          <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40094000"/>
            
          <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40098000"/>
            
          <signals>
              <signal pad="PC7" function="B" group="TCLK" index="6"/>
              <signal pad="PC10" function="B" group="TCLK" index="7"/>
              <signal pad="PC14" function="B" group="TCLK" index="8"/>
              <signal pad="PC5" function="B" group="TIOA" index="6"/>
              <signal pad="PC8" function="B" group="TIOA" index="7"/>
              <signal pad="PC11" function="B" group="TIOA" index="8"/>
              <signal pad="PC6" function="B" group="TIOB" index="6"/>
              <signal pad="PC9" function="B" group="TIOB" index="7"/>
              <signal pad="PC12" function="B" group="TIOB" index="8"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" id="6212" version="M">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x400A8000"/>
            
          <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x400AC000"/>
            
          <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="6418" version="G">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            
          <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x40060600"/>
            
          <signals>
              <signal pad="PA5" function="C" group="URXD" index="1"/>
              <signal pad="PA6" function="C" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UDP" id="6083" version="V">
          <instance name="UDP">
            <register-group address-space="base" name="UDP" name-in-module="UDP" offset="0x40084000"/>
          </instance>
        </module>
        <module name="USART" id="6089" version="Z">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x400A0000"/>
            
          <signals>
              <signal pad="PB2" function="C" group="CTS" index="0"/>
              <signal pad="PB3" function="C" group="RTS" index="0"/>
              <signal pad="PB0" function="C" group="RXD" index="0"/>
              <signal pad="PB13" function="C" group="SCK" index="0"/>
              <signal pad="PB1" function="C" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x400A4000"/>
            
          <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA26" function="A" group="DCD" index="1"/>
              <signal pad="PA28" function="A" group="DSR" index="1"/>
              <signal pad="PA27" function="A" group="DTR" index="1"/>
              <signal pad="PA29" function="A" group="RI" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PA22" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="6080" version="C">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
