Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
        <register caption="Mailbox ID Register (MB = 5)" name="CAN_MID5" offset="0x2A8" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 5)" name="CAN_MFID5" offset="0x2AC" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 5)" name="CAN_MSR5" offset="0x2B0" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 5)" name="CAN_MDL5" offset="0x2B4" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 5)" name="CAN_MDH5" offset="0x2B8" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 5)" name="CAN_MCR5" offset="0x2BC" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 6)" name="CAN_MMR6" offset="0x2C0" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR6__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 6)" name="CAN_MAM6" offset="0x2C4" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 6)" name="CAN_MID6" offset="0x2C8" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 6)" name="CAN_MFID6" offset="0x2CC" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 6)" name="CAN_MSR6" offset="0x2D0" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 6)" name="CAN_MDL6" offset="0x2D4" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 6)" name="CAN_MDH6" offset="0x2D8" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 6)" name="CAN_MCR6" offset="0x2DC" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 7)" name="CAN_MMR7" offset="0x2E0" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR7__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 7)" name="CAN_MAM7" offset="0x2E4" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
