Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Flag" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Flag" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of DMA Interrupt Flag" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
          <bitfield caption="Bias Current Control for DAC Core" mask="0x00000300" name="IBCTLDACCORE"/>
        </register>
        <register caption="Write Protect Mode register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write protection error" mask="0x00000001" name="WPROTERR"/>
          <bitfield caption="Write protection error address" mask="0x0000FF00" name="WPROTADDR"/>
        </register>
        <register caption="Transmit Pointer Register" name="DACC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="DACC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="DACC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="DACC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="DACC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="DACC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
        </register-group>
      <value-group caption="" name="DACC_MR__TRGEN">
        <value caption="External trigger mode disabled. DACC in free running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="Half-Word transfer" name="HALF" value="0"/>
        <value caption="Word Transfer" name="WORD" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__USER_SEL">
        <value caption="Channel 0" name="CHANNEL0" value="0"/>
        <value caption="Channel 1" name="CHANNEL1" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TAG">
        <value caption="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." name="DIS" value="0"/>
        <value caption="Tag selection mode enabled" name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS">
        <value caption="Normal Mode" name="NORMAL" value="0"/>
        <value caption="Max Speed Mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__CLKDIV">
        <value caption="The DAC clock is MCK divided by 2" name="DIV_2" value="0"/>
        <value caption="The DAC clock is MCK divided by 4 (to be used when MCK frequency is above 100MHz)" name="DIV_4" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__STARTUP">
        <value caption="0 periods of DACClock" name="_0" value="0x0"/>
        <value caption="8 periods of DACClock" name="_8" value="0x1"/>
        <value caption="16 periods of DACClock" name="_16" value="0x2"/>
        <value caption="24 periods of DACClock" name="_24" value="0x3"/>
        <value caption="64 periods of DACClock" name="_64" value="0x4"/>
        <value caption="80 periods of DACClock" name="_80" value="0x5"/>
        <value caption="96 periods of DACClock" name="_96" value="0x6"/>
        <value caption="112 periods of DACClock" name="_112" value="0x7"/>
        <value caption="512 periods of DACClock" name="_512" value="0x8"/>
        <value caption="576 periods of DACClock" name="_576" value="0x9"/>
        <value caption="640 periods of DACClock" name="_640" value="0xA"/>
        <value caption="704 periods of DACClock" name="_704" value="0xB"/>
        <value caption="768 periods of DACClock" name="_768" value="0xC"/>
        <value caption="832 periods of DACClock" name="_832" value="0xD"/>
        <value caption="896 periods of DACClock" name="_896" value="0xE"/>
        <value caption="960 periods of DACClock" name="_960" value="0xF"/>
        <value caption="1024 periods of DACClock" name="_1024" value="0x10"/>
        <value caption="1088 periods of DACClock" name="_1088" value="0x11"/>
        <value caption="1152 periods of DACClock" name="_1152" value="0x12"/>
        <value caption="1216 periods of DACClock" name="_1216" value="0x13"/>
        <value caption="1280 periods of DACClock" name="_1280" value="0x14"/>
        <value caption="1344 periods of DACClock" name="_1344" value="0x15"/>
        <value caption="1408 periods of DACClock" name="_1408" value="0x16"/>
        <value caption="1472 periods of DACClock" name="_1472" value="0x17"/>
        <value caption="1536 periods of DACClock" name="_1536" value="0x18"/>
        <value caption="1600 periods of DACClock" name="_1600" value="0x19"/>
        <value caption="1664 periods of DACClock" name="_1664" value="0x1A"/>
        <value caption="1728 periods of DACClock" name="_1728" value="0x1B"/>
        <value caption="1792 periods of DACClock" name="_1792" value="0x1C"/>
        <value caption="1856 periods of DACClock" name="_1856" value="0x1D"/>
        <value caption="1920 periods of DACClock" name="_1920" value="0x1E"/>
        <value caption="1984 periods of DACClock" name="_1984" value="0x1F"/>
      </value-group>
    </module>
    <module name="DMAC" caption="DMA Controller" id="6233" version="O">
      <register-group name="DMAC"><register caption="DMAC Global Configuration Register" name="DMAC_GCFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="Arbiter Configuration" mask="0x00000010" name="ARB_CFG" values="DMAC_GCFG__ARB_CFG"/>
        </register>
