Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
        <register caption="DMAC Channel Handler Status Register" name="DMAC_CHSR" offset="0x030" rw="R" size="4">
          <bitfield caption="Enable [3:0]" mask="0x00000001" name="ENA0"/>
          <bitfield caption="Enable [3:0]" mask="0x00000002" name="ENA1"/>
          <bitfield caption="Enable [3:0]" mask="0x00000004" name="ENA2"/>
          <bitfield caption="Enable [3:0]" mask="0x00000008" name="ENA3"/>
          <bitfield caption="Suspend [3:0]" mask="0x00000100" name="SUSP0"/>
          <bitfield caption="Suspend [3:0]" mask="0x00000200" name="SUSP1"/>
          <bitfield caption="Suspend [3:0]" mask="0x00000400" name="SUSP2"/>
          <bitfield caption="Suspend [3:0]" mask="0x00000800" name="SUSP3"/>
          <bitfield caption="Empty [3:0]" mask="0x00010000" name="EMPT0"/>
          <bitfield caption="Empty [3:0]" mask="0x00020000" name="EMPT1"/>
          <bitfield caption="Empty [3:0]" mask="0x00040000" name="EMPT2"/>
          <bitfield caption="Empty [3:0]" mask="0x00080000" name="EMPT3"/>
          <bitfield caption="Stalled [3:0]" mask="0x01000000" name="STAL0"/>
          <bitfield caption="Stalled [3:0]" mask="0x02000000" name="STAL1"/>
          <bitfield caption="Stalled [3:0]" mask="0x04000000" name="STAL2"/>
          <bitfield caption="Stalled [3:0]" mask="0x08000000" name="STAL3"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 0)" name="DMAC_SADDR0" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 0)" name="DMAC_DADDR0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
        <register caption="DMAC Channel Descriptor Address Register (ch_num = 0)" name="DMAC_DSCR0" offset="0x44" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Descriptor Address" mask="0xFFFFFFFC" name="DSCR"/>
        </register>
        <register caption="DMAC Channel Control A Register (ch_num = 0)" name="DMAC_CTRLA0" offset="0x48" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA0__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA0__DST_WIDTH"/>
          <bitfield caption="Current Descriptor Stop Command and Transfer Completed Memory Indicator" mask="0x80000000" name="DONE"/>
        </register>
        <register caption="DMAC Channel Control B Register (ch_num = 0)" name="DMAC_CTRLB0" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Source Address Descriptor" mask="0x00010000" name="SRC_DSCR" values="DMAC_CTRLB0__SRC_DSCR"/>
          <bitfield caption="Destination Address Descriptor" mask="0x00100000" name="DST_DSCR" values="DMAC_CTRLB0__DST_DSCR"/>
          <bitfield caption="Flow Control" mask="0x00600000" name="FC" values="DMAC_CTRLB0__FC"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Source" mask="0x03000000" name="SRC_INCR" values="DMAC_CTRLB0__SRC_INCR"/>
          <bitfield caption="Incrementing, Decrementing or Fixed Address for the Destination" mask="0x30000000" name="DST_INCR" values="DMAC_CTRLB0__DST_INCR"/>
          <bitfield caption="Interrupt Enable Not" mask="0x40000000" name="IEN"/>
        </register>
        <register caption="DMAC Channel Configuration Register (ch_num = 0)" name="DMAC_CFG0" offset="0x50" rw="RW" size="4">
          <bitfield caption="Source with Peripheral identifier" mask="0x0000000F" name="SRC_PER"/>
          <bitfield caption="Destination with Peripheral identifier" mask="0x000000F0" name="DST_PER"/>
          <bitfield caption="Software or Hardware Selection for the Source" mask="0x00000200" name="SRC_H2SEL" values="DMAC_CFG0__SRC_H2SEL"/>
          <bitfield caption="Software or Hardware Selection for the Destination" mask="0x00002000" name="DST_H2SEL" values="DMAC_CFG0__DST_H2SEL"/>
          <bitfield caption="Stop On Done" mask="0x00010000" name="SOD" values="DMAC_CFG0__SOD"/>
          <bitfield caption="Interface Lock" mask="0x00100000" name="LOCK_IF" values="DMAC_CFG0__LOCK_IF"/>
          <bitfield caption="Bus Lock" mask="0x00200000" name="LOCK_B" values="DMAC_CFG0__LOCK_B"/>
          <bitfield caption="Master Interface Arbiter Lock" mask="0x00400000" name="LOCK_IF_L" values="DMAC_CFG0__LOCK_IF_L"/>
          <bitfield caption="AHB Protection" mask="0x07000000" name="AHB_PROT"/>
          <bitfield caption="FIFO Configuration" mask="0x30000000" name="FIFOCFG" values="DMAC_CFG0__FIFOCFG"/>
        </register>
        <register caption="DMAC Channel Source Address Register (ch_num = 1)" name="DMAC_SADDR1" offset="0x64" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SADDR"/>
        </register>
        <register caption="DMAC Channel Destination Address Register (ch_num = 1)" name="DMAC_DADDR1" offset="0x68" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DADDR"/>
        </register>
        <register caption="DMAC Channel Descriptor Address Register (ch_num = 1)" name="DMAC_DSCR1" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Descriptor Address" mask="0xFFFFFFFC" name="DSCR"/>
        </register>
        <register caption="DMAC Channel Control A Register (ch_num = 1)" name="DMAC_CTRLA1" offset="0x70" rw="RW" size="4">
          <bitfield caption="Buffer Transfer Size" mask="0x0000FFFF" name="BTSIZE"/>
          <bitfield caption="Transfer Width for the Source" mask="0x03000000" name="SRC_WIDTH" values="DMAC_CTRLA1__SRC_WIDTH"/>
          <bitfield caption="Transfer Width for the Destination" mask="0x30000000" name="DST_WIDTH" values="DMAC_CTRLA1__DST_WIDTH"/>
          <bitfield caption="Current Descriptor Stop Command and Transfer Completed Memory Indicator" mask="0x80000000" name="DONE"/>
        </register>
