Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16C.atdf
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="the RTT alarm signal has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTT alarm signal forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="the RTC alarm signal has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTC alarm signal forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN0">
        <value caption="the WKUP0 input pin is not connected with low power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="the WKUP0 input pin is connected with low power debouncer and can force a core wake up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN1">
        <value caption="the WKUP1input pin is not connected with low power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="the WKUP1 input pin is connected with low power debouncer and can force a core wake up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCCLR">
        <value caption="a low power debounce event does not create an immediate clear on first half GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="a low power debounce event on WKUP0 or WKUP1 generates an immediate clear on first half GPBR registers." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="FWUP shall be low for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="FWUP shall be low for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="FWUP shall be low for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="FWUP shall be low for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="FWUP shall be low for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBC">
        <value caption="Disable the low power debouncer." name="DISABLE" value="0x0"/>
        <value caption="WKUP0/1 in its active state for at least 2 RTCOUT0 periods" name="_2_RTCOUT0" value="0x1"/>
        <value caption="WKUP0/1 in its active state for at least 3 RTCOUT0 periods" name="_3_RTCOUT0" value="0x2"/>
        <value caption="WKUP0/1 in its active state for at least 4 RTCOUT0 periods" name="_4_RTCOUT0" value="0x3"/>
        <value caption="WKUP0/1 in its active state for at least 5 RTCOUT0 periods" name="_5_RTCOUT0" value="0x4"/>
        <value caption="WKUP0/1 in its active state for at least 6 RTCOUT0 periods" name="_6_RTCOUT0" value="0x5"/>
        <value caption="WKUP0/1 in its active state for at least 7 RTCOUT0 periods" name="_7_RTCOUT0" value="0x6"/>
        <value caption="WKUP0/1 in its active state for at least 8 RTCOUT0 periods" name="_8_RTCOUT0" value="0x7"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN0">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN1">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN2">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN3">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN4">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN5">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN6">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN7">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN8">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
